test_results/bench_mark2.txt
gan@gan-ubuntu:~/csc326$ ab -n 1000 -c 50 http://54.196.143.244:80/?keywords=helloworld+foo+bar
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 54.196.143.244 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        WSGIServer/0.1
Server Hostname:        54.196.143.244
Server Port:            80

Document Path:          /?keywords=helloworld+foo+bar
Document Length:        2400 bytes

Concurrency Level:      50
Time taken for tests:   6.949 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      2559000 bytes
HTML transferred:       2400000 bytes
Requests per second:    143.90 [#/sec] (mean)
Time per request:       347.473 [ms] (mean)
Time per request:       6.949 [ms] (mean, across all concurrent requests)
Transfer rate:          359.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       57  160 104.4    140    1170
Processing:    53  175 156.6    141    1547
Waiting:       53  173 155.0    139    1546
Total:        112  335 190.2    283    1783

Percentage of the requests served within a certain time (ms)
  50%    283
  66%    321
  75%    349
  80%    374
  90%    460
  95%    529
  98%   1224
  99%   1345
 100%   1783 (longest request)