test_results/bench_mark3.txt
jinyinodiannao:csc326 jinyichen$ ab -n 1000 -c 50 http://54.88.204.39/?keywords=helloworld+foo+bar
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 54.88.204.39 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
^C

Server Software:        WSGIServer/0.1
Server Hostname:        54.88.204.39
Server Port:            80

Document Path:          /?keywords=helloworld+foo+bar
Document Length:        1694 bytes

Concurrency Level:      50
Time taken for tests:   29.017 seconds
Complete requests:      999
Failed requests:        0
Total transferred:      1851147 bytes
HTML transferred:       1692306 bytes
Requests per second:    34.43 [#/sec] (mean)
Time per request:       1452.280 [ms] (mean)
Time per request:       29.046 [ms] (mean, across all concurrent requests)
Transfer rate:          62.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       34   75 194.2     39    1276
Processing:    37   91 199.6     45    1837
Waiting:       36   90 199.4     44    1837
Total:         71  165 279.6     85    1881

Percentage of the requests served within a certain time (ms)
  50%     85
  66%     92
  75%    102
  80%    108
  90%    281
  95%    549
  98%   1293
  99%   1728
 100%   1881 (longest request)