test_results/bench_mark4.txt
gan@gan-ubuntu:~/csc326$ ab -n 900 -c 10 http://52.87.155.235/?keywords=helloworld+foo+bar
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 52.87.155.235 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Finished 900 requests


Server Software:        WSGIServer/0.1
Server Hostname:        52.87.155.235
Server Port:            80

Document Path:          /?keywords=helloworld+foo+bar
Document Length:        1694 bytes

Concurrency Level:      10
Time taken for tests:   12.181 seconds
Complete requests:      900
Failed requests:        0
Total transferred:      1667700 bytes
HTML transferred:       1524600 bytes
Requests per second:    73.88 [#/sec] (mean)
Time per request:       135.349 [ms] (mean)
Time per request:       13.535 [ms] (mean, across all concurrent requests)
Transfer rate:          133.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       40   67  47.9     57    1079
Processing:    44   68  32.9     59     307
Waiting:       42   67  31.9     58     305
Total:         88  135  62.0    119    1129

Percentage of the requests served within a certain time (ms)
  50%    119
  66%    127
  75%    134
  80%    139
  90%    176
  95%    280
  98%    340
  99%    363
 100%   1129 (longest request)