test_results/bench_mark5.txt
gan@gan-ubuntu:~/csc326$ ab -n 1000 -c 50 -t 2 http://52.87.155.235/?keywords=helloworld+foo+bar
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 52.87.155.235 (be patient)
Finished 254 requests


Server Software:        WSGIServer/0.1
Server Hostname:        52.87.155.235
Server Port:            80

Document Path:          /?keywords=helloworld+foo+bar
Document Length:        1694 bytes

Concurrency Level:      50
Time taken for tests:   2.028 seconds
Complete requests:      254
Failed requests:        0
Total transferred:      470662 bytes
HTML transferred:       430276 bytes
Requests per second:    125.24 [#/sec] (mean)
Time per request:       399.234 [ms] (mean)
Time per request:       7.985 [ms] (mean, across all concurrent requests)
Transfer rate:          226.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       54  122  34.9    124     217
Processing:    81  209 240.9    137    1171
Waiting:       77  207 240.5    135    1171
Total:        141  331 241.1    261    1308

Percentage of the requests served within a certain time (ms)
  50%    261
  66%    286
  75%    299
  80%    316
  90%    433
  95%   1055
  98%   1256
  99%   1262
 100%   1308 (longest request)